
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11875072348)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 25 to change, 5 to destroy.</code></pre>

* Update
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Expectation :butterfly:
          - > What behavior is expected?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Reality :bug:
          - > How does it actually work?
          + ## Expectation :butterfly:
          + > [Delete me] What behavior is expected?
            
          - # Environment :evergreen_tree:
          - > (When and) Where the behavior was observed?
          + ## Reality :bug:
          + > [Delete me] How does it actually work?
            
          - # Cause :mag:
          - > Why this issue was occurred?
          + ## Environment :evergreen_tree:
          + > [Delete me] (When and) Where the behavior was observed?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Cause :mag:
          + > [Delete me] Why this issue was occurred?
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "devcontainer-features/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
        id                  = "devcontainer-features/.github/labeler.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Overview :rocket:
          - > What is this pull request?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Implementation :clamp:
          - > How to realize ?
          + ## Overview :rocket:
          + > [Delete me] What is this pull request?
            
          - # Use cases :chopsticks:
          - > Why this pull request was created?
          + ## Implementation :clamp:
          + > [Delete me] How to realize ?
            
          - # Testing :gear:
          - > Testing steps
          + ## Use cases :chopsticks:
          + > [Delete me] Why this pull request was created?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Testing :gear:
          + > [Delete me] Testing steps
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "devcontainer-features/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
        id                  = "devcontainer-features/.github/release.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
        id                  = "devcontainer-features/.github/workflows/labeler.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "924fb8c42697689134acb3afeede2bf987f6dc54" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "0745844c44e14a91076aaa80760b81db7b9f7814" -> (known after apply)
      ~ id                    = "hayas1:devcontainer-features:42" -> (known after apply)
      ~ labels                = [] -> (known after apply)
      ~ number                = 42 -> (known after apply)
      ~ opened_at             = 1731502374 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731513883 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Expectation :butterfly:
          - > What behavior is expected?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Reality :bug:
          - > How does it actually work?
          + ## Expectation :butterfly:
          + > [Delete me] What behavior is expected?
            
          - # Environment :evergreen_tree:
          - > (When and) Where the behavior was observed?
          + ## Reality :bug:
          + > [Delete me] How does it actually work?
            
          - # Cause :mag:
          - > Why this issue was occurred?
          + ## Environment :evergreen_tree:
          + > [Delete me] (When and) Where the behavior was observed?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Cause :mag:
          + > [Delete me] Why this issue was occurred?
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "dyson-rs/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
        id                              = "dyson-rs/.github/labeler.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          - # Overview :rocket:
          - > What is this pull request?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Implementation :clamp:
          - > How to realize ?
          + ## Overview :rocket:
          + > [Delete me] What is this pull request?
            
          - # Use cases :chopsticks:
          - > Why this pull request was created?
          + ## Implementation :clamp:
          + > [Delete me] How to realize ?
            
          - # Testing :gear:
          - > Testing steps
          + ## Use cases :chopsticks:
          + > [Delete me] Why this pull request was created?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Testing :gear:
          + > [Delete me] Testing steps
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                              = "dyson-rs/.github/pull_request_template.md"
        # (11 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
        id                              = "dyson-rs/.github/release.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
        id                              = "dyson-rs/.github/workflows/labeler.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d94a2b4dc8f49e29b32e8c7e9f43c3b58667fa8e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "13f7b06ca47472fb756a348ba7a300faf59ebe26" -> (known after apply)
      ~ id                    = "hayas1:dyson-rs:10" -> (known after apply)
      ~ labels                = [
          - "documentation",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 10 -> (known after apply)
      ~ opened_at             = 1731680607 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731680618 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Expectation :butterfly:
          - > What behavior is expected?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Reality :bug:
          - > How does it actually work?
          + ## Expectation :butterfly:
          + > [Delete me] What behavior is expected?
            
          - # Environment :evergreen_tree:
          - > (When and) Where the behavior was observed?
          + ## Reality :bug:
          + > [Delete me] How does it actually work?
            
          - # Cause :mag:
          - > Why this issue was occurred?
          + ## Environment :evergreen_tree:
          + > [Delete me] (When and) Where the behavior was observed?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Cause :mag:
          + > [Delete me] Why this issue was occurred?
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "json-with-comments/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
        id                  = "json-with-comments/.github/labeler.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Overview :rocket:
          - > What is this pull request?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Implementation :clamp:
          - > How to realize ?
          + ## Overview :rocket:
          + > [Delete me] What is this pull request?
            
          - # Use cases :chopsticks:
          - > Why this pull request was created?
          + ## Implementation :clamp:
          + > [Delete me] How to realize ?
            
          - # Testing :gear:
          - > Testing steps
          + ## Use cases :chopsticks:
          + > [Delete me] Why this pull request was created?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Testing :gear:
          + > [Delete me] Testing steps
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "json-with-comments/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
        id                  = "json-with-comments/.github/release.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
        id                  = "json-with-comments/.github/workflows/labeler.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5cc937a63844a086691695303161c7ae382336d9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "05c0b0725de3e3afa8cb986afb4e046004c49fea" -> (known after apply)
      ~ id                    = "hayas1:json-with-comments:45" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 45 -> (known after apply)
      ~ opened_at             = 1731680609 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731680624 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Expectation :butterfly:
          - > What behavior is expected?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Reality :bug:
          - > How does it actually work?
          + ## Expectation :butterfly:
          + > [Delete me] What behavior is expected?
            
          - # Environment :evergreen_tree:
          - > (When and) Where the behavior was observed?
          + ## Reality :bug:
          + > [Delete me] How does it actually work?
            
          - # Cause :mag:
          - > Why this issue was occurred?
          + ## Environment :evergreen_tree:
          + > [Delete me] (When and) Where the behavior was observed?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Cause :mag:
          + > [Delete me] Why this issue was occurred?
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "tfgh/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
        id                              = "tfgh/.github/labeler.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          - # Overview :rocket:
          - > What is this pull request?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Implementation :clamp:
          - > How to realize ?
          + ## Overview :rocket:
          + > [Delete me] What is this pull request?
            
          - # Use cases :chopsticks:
          - > Why this pull request was created?
          + ## Implementation :clamp:
          + > [Delete me] How to realize ?
            
          - # Testing :gear:
          - > Testing steps
          + ## Use cases :chopsticks:
          + > [Delete me] Why this pull request was created?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Testing :gear:
          + > [Delete me] Testing steps
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                              = "tfgh/.github/pull_request_template.md"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
        id                              = "tfgh/.github/release.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
        id                              = "tfgh/.github/workflows/labeler.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "8120c226c32c74ee896e9eec444d8844adbb17b7" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "85b085f9934a6a5bf28c69cf5a78af7ca1905961" -> (known after apply)
      ~ id                    = "hayas1:tfgh:65" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 65 -> (known after apply)
      ~ opened_at             = 1731598103 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731598527 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Expectation :butterfly:
          - > What behavior is expected?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Reality :bug:
          - > How does it actually work?
          + ## Expectation :butterfly:
          + > [Delete me] What behavior is expected?
            
          - # Environment :evergreen_tree:
          - > (When and) Where the behavior was observed?
          + ## Reality :bug:
          + > [Delete me] How does it actually work?
            
          - # Cause :mag:
          - > Why this issue was occurred?
          + ## Environment :evergreen_tree:
          + > [Delete me] (When and) Where the behavior was observed?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Cause :mag:
          + > [Delete me] Why this issue was occurred?
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "tokei-toukei/.github/issue_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
        id                  = "tokei-toukei/.github/labeler.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          - # Overview :rocket:
          - > What is this pull request?
          + <!-- Managed by terraform. https://github.com/hayas1/tfgh -->
            
          - # Implementation :clamp:
          - > How to realize ?
          + ## Overview :rocket:
          + > [Delete me] What is this pull request?
            
          - # Use cases :chopsticks:
          - > Why this pull request was created?
          + ## Implementation :clamp:
          + > [Delete me] How to realize ?
            
          - # Testing :gear:
          - > Testing steps
          + ## Use cases :chopsticks:
          + > [Delete me] Why this pull request was created?
            
          - # Related :chains:
          - > The list of related issues or pull requests
          + ## Testing :gear:
          + > [Delete me] Testing steps
            
          - # Remark :eyes:
          - > Any remarks
          + ## Related :chains:
          + > [Delete me] The list of related issues or pull requests
          + 
          + ## Remark :eyes:
          + > [Delete me] Any remarks
        EOT
        id                  = "tokei-toukei/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
        id                  = "tokei-toukei/.github/release.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
          + # Managed by terraform. https://github.com/hayas1/tfgh
          + 
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
        id                  = "tokei-toukei/.github/workflows/labeler.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d0b3dbb3471c681e30c750be2eba289e1e17593e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "e037d6c8e785820d39eb1c864777515a045adc77" -> (known after apply)
      ~ id                    = "hayas1:tokei-toukei:26" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 26 -> (known after apply)
      ~ opened_at             = 1731779349 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731779360 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 25 to change, 5 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"fb23f22ef63556b783cc7b943c5aafc380839dd9f86cb4f077b7c18efae1c24f\"" -> "W/\"66759713f20c7fcfed546ab84decab22578a19027eddde89d2f51a792f894d53\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"b15ab5f51210d993a88946e9c428e7b7906558979b333e79ab3f150569877fcb\"" -> "W/\"490f9013582e236dabce826b3231e4ad59ce4794b1ee7a79b5a7d5abcf39d595\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4f3a92c52fecbb19208b8ec0640dda8cb467ffa56a922bb8836ebef2457dbf58\"" -> "W/\"abb964a16de5209f4fa526c9aabdb69894be5ed4c590d1b139cfd94727256d47\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"7d7fc90033c2a4e65b4ba00a579f72721d08ef0746762d3ff706ab344cfca07e\"" -> "W/\"113c2cd723bf01f2287cd35222537fc0382f6f4e5c139424a672ae5d0ee0493d\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9b17f11fcb4e99537306cc0402db4d60b6778409691db31f315c49cd96f9e143\"" -> "W/\"ed43b5e3cbeae473433ad28e39adef338c2173109252764f8102cff3e6626a7b\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":74,"Program":"tfcmt","SHA1":"5d69b297ed88c92239544fef8ebe6235aac6279f","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->